In [6]:
import pandas as pd

### skiprows and header

In [7]:
df = pd.read_csv('./stock_data.csv', skiprows=1)
df

  GOOGL          27.82   87   845     larry page
0   WMT           4.61  484    65           n.a.
1  MSFT             -1   85    64     bill gates
2  RIL   not available   50  1023  mukesh ambani
3  TATA            5.6   -1  n.a.     ratan tata

In [8]:
df = pd.read_csv('./stock_data.csv', header=1)
df

  GOOGL          27.82   87   845     larry page
0   WMT           4.61  484    65           n.a.
1  MSFT             -1   85    64     bill gates
2  RIL   not available   50  1023  mukesh ambani
3  TATA            5.6   -1  n.a.     ratan tata

In [9]:
# If CSV file dont have headers then use header=None
df = pd.read_csv('./stock_data.csv', header=None)
df

         0              1        2      3              4
0  tickers            eps  revenue  price         people
1    GOOGL          27.82       87    845     larry page
2      WMT           4.61      484     65           n.a.
3     MSFT             -1       85     64     bill gates
4     RIL   not available       50   1023  mukesh ambani
5     TATA            5.6       -1   n.a.     ratan tata

### How to give column or header name?

In [10]:
# If CSV file dont have header and you want to specify the column names then use names
df = pd.read_csv('./stock_data.csv', header=None, names=['Tickers', 'Eps', 'Revenue', 'Price', 'People'])
df

   Tickers            Eps  Revenue  Price         People
0  tickers            eps  revenue  price         people
1    GOOGL          27.82       87    845     larry page
2      WMT           4.61      484     65           n.a.
3     MSFT             -1       85     64     bill gates
4     RIL   not available       50   1023  mukesh ambani
5     TATA            5.6       -1   n.a.     ratan tata

### Read limited data from CSV file

In [11]:
# If you want to read only some rows from the CSV file then you can use 

df = pd.read_csv('./stock_data.csv', nrows=2)
df

  tickers    eps  revenue  price      people
0   GOOGL  27.82       87    845  larry page
1     WMT   4.61      484     65        n.a.

### Clean up messy data from file "not available" and "n.a." replace with "na_values"

In [12]:
df = pd.read_csv('./stock_data.csv', na_values=["not available", "n.a."])
df

  tickers    eps  revenue   price         people
0   GOOGL  27.82       87   845.0     larry page
1     WMT   4.61      484    65.0            NaN
2    MSFT  -1.00       85    64.0     bill gates
3    RIL     NaN       50  1023.0  mukesh ambani
4    TATA   5.60       -1     NaN     ratan tata

### Supply dictionary for replace with "na_values"

In [13]:
df = pd.read_csv('./stock_data.csv', na_values={
    'esp': ["not available", "n.a."],
    'revenue': ["not available", "n.a.", -1],
    'people': ["not available", "n.a."]
})
df

  tickers            eps  revenue price         people
0   GOOGL          27.82     87.0   845     larry page
1     WMT           4.61    484.0    65            NaN
2    MSFT             -1     85.0    64     bill gates
3    RIL   not available     50.0  1023  mukesh ambani
4    TATA            5.6      NaN  n.a.     ratan tata

### Write dataframe into "csv" file with "to_csv() method"

In [14]:
# to_csv will write index values by default and if you don't want to write index then you need to pass index=False in t0_csv function

df.to_csv('new_created.csv', index=False)

In [15]:
df.columns

Index(['tickers', 'eps', 'revenue', 'price', 'people'], dtype='object')

In [17]:
# Now lets say i wam to export only few colums out of the datafram then
df.to_csv("new_created.csv", columns=['tickers', 'eps'])

In [18]:
# If you want to skip exporting the header then
df.to_csv("new_created.csv", header=False)

### Read excel file using read_excel() method

In [23]:
def conver_people_cell(cell):
    if cell == "n.a.":
        return "sem Walton"
    return cell

read_exc = pd.read_excel('./stock_data.xlsx', "Sheet1",converters= {
    'people': conver_people_cell
})
read_exc

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65     sem Walton
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

### Write dataframe into "excel" file with "to_excel() method"

In [26]:
read_exc.to_excel("new_excel.xlsx", sheet_name = "stocks")

In [28]:
# if you want to start writting your data from column number 2 and 3 for example then
read_exc.to_excel("new_excel.xlsx", sheet_name = "stocks", startrow=2, startcol=3)

### Use ExcelWritter() class

In [29]:
df_stocks = pd.DataFrame({
    'tickers': ['GOOGL', 'WMT', 'MSFT'],
    'price': [845, 65, 64 ],
    'pe': [30.37, 14.26, 30.97],
    'eps': [27.82, 4.61, 2.12]
})

df_weather =  pd.DataFrame({
    'day': ['1/1/2017','1/2/2017','1/3/2017'],
    'temperature': [32,35,28],
    'event': ['Rain', 'Sunny', 'Snow']
}) 

with pd.ExcelWriter('stocks_weather_murge_of_twoDF.xlsx') as writer:
    df_stocks.to_excel(writer, sheet_name="stocks")
    df_weather.to_excel(writer, sheet_name="weather")